In [1]:
import pandas as pd

In [2]:
# dataframe - 2d shape
df = pd.read_csv("student_records_reordered.csv")

In [3]:
df

    roll_number    name  maths  physics  chemistry  english
0           101   Aarav     85       88         87       90
1           102  Bhavya     78       72         76       75
2           103  Charvi     90       91         89       92
3           104     Dev     66       69         70       73
4           105    Esha     74       77         78       80
5           106  Farhan     80       82         81       84
6           107  Garima     89       85         90       86
7           108   Harsh     92       95         94       96
8           109  Ishita     76       74         75       79
9           110     Jay     85       87         86       88
10          111   Kavya     79       80         81       83
11          112   Laksh     83       86         85       87
12          113   Meera     88       89         87       91
13          114   Nitin     75       78         76       77
14          115    Ojas     91       92         93       94
15          116  Prisha     84       83         82       85
16          117   Qasim     70       72         73       74
17          118  Ritika     77       79         78       81
18          119   Samar     93       94         95       97
19          120   Tanvi     81       82         80       83

In [4]:
df.head()

   roll_number    name  maths  physics  chemistry  english
0          101   Aarav     85       88         87       90
1          102  Bhavya     78       72         76       75
2          103  Charvi     90       91         89       92
3          104     Dev     66       69         70       73
4          105    Esha     74       77         78       80

In [6]:
df.shape

(20, 6)

In [7]:
df.columns

Index(['roll_number', 'name', 'maths', 'physics', 'chemistry', 'english'], dtype='object')

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   roll_number  20 non-null     int64
 1   name         20 non-null     object
 2   maths        20 non-null     int64
 3   physics      20 non-null     int64
 4   chemistry    20 non-null     int64
 5   english      20 non-null     int64
dtypes: int64(5), object(1)
memory usage: 1.1+ KB

In [9]:
df.describe()

       roll_number      maths   physics  chemistry    english
count     20.00000  20.000000  20.00000  20.000000  20.000000
mean     110.50000  81.800000  82.75000  82.800000  84.750000
std        5.91608   7.529591   7.62872   7.230054   7.195576
min      101.00000  66.000000  69.00000  70.000000  73.000000
25%      105.75000  76.750000  77.75000  77.500000  79.750000
50%      110.50000  82.000000  82.50000  81.500000  84.500000
75%      115.25000  88.250000  88.25000  87.500000  90.250000
max      120.00000  93.000000  95.00000  95.000000  97.000000

In [10]:
df.loc[:,'maths'].value_counts()

maths
85    2
83    1
93    1
77    1
70    1
84    1
91    1
75    1
88    1
79    1
78    1
76    1
92    1
89    1
80    1
74    1
66    1
90    1
81    1
Name: count, dtype: int64

In [11]:
df.isnull().sum()

roll_number    0
name           0
maths          0
physics        0
chemistry      0
english        0
dtype: int64

In [12]:
df.drop('chemistry', axis=1)

    roll_number    name  maths  physics  english
0           101   Aarav     85       88       90
1           102  Bhavya     78       72       75
2           103  Charvi     90       91       92
3           104     Dev     66       69       73
4           105    Esha     74       77       80
5           106  Farhan     80       82       84
6           107  Garima     89       85       86
7           108   Harsh     92       95       96
8           109  Ishita     76       74       79
9           110     Jay     85       87       88
10          111   Kavya     79       80       83
11          112   Laksh     83       86       87
12          113   Meera     88       89       91
13          114   Nitin     75       78       77
14          115    Ojas     91       92       94
15          116  Prisha     84       83       85
16          117   Qasim     70       72       74
17          118  Ritika     77       79       81
18          119   Samar     93       94       97
19          120   Tanvi     81       82       83

In [15]:
df

    roll_number    name  maths  physics  chemistry  english
0           101   Aarav     85       88         87       90
1           102  Bhavya     78       72         76       75
2           103  Charvi     90       91         89       92
3           104     Dev     66       69         70       73
4           105    Esha     74       77         78       80
5           106  Farhan     80       82         81       84
6           107  Garima     89       85         90       86
7           108   Harsh     92       95         94       96
8           109  Ishita     76       74         75       79
9           110     Jay     85       87         86       88
10          111   Kavya     79       80         81       83
11          112   Laksh     83       86         85       87
12          113   Meera     88       89         87       91
13          114   Nitin     75       78         76       77
14          115    Ojas     91       92         93       94
15          116  Prisha     84       83         82       85
16          117   Qasim     70       72         73       74
17          118  Ritika     77       79         78       81
18          119   Samar     93       94         95       97
19          120   Tanvi     81       82         80       83

In [18]:
df[df.loc[:,'chemistry'] == 87]

    roll_number   name  maths  physics  chemistry  english
0           101  Aarav     85       88         87       90
12          113  Meera     88       89         87       91

In [19]:
df.shape

(20, 6)

In [20]:
df.tail()

    roll_number    name  maths  physics  chemistry  english
15          116  Prisha     84       83         82       85
16          117   Qasim     70       72         73       74
17          118  Ritika     77       79         78       81
18          119   Samar     93       94         95       97
19          120   Tanvi     81       82         80       83